## Terraform Plan (Ticket: Terraform ECS Task Definition)

```
Terraform will perform the following actions:

  # aws_ecs_task_definition.abatugo_autoscribe_task will be created
  + resource "aws_ecs_task_definition" "abatugo_autoscribe_task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 10
                  + environment  = [
                      + {
                          + name  = "s3_bucket_arn"
                          + value = "arn:aws:s3:::batugo-autoscribe"
                        },
                    ]
                  + essential    = true
                  + image        = "061051226319.dkr.ecr.us-east-1.amazonaws.com/abatugo_autoscribe:0.0.3"
                  + memory       = 512
                  + name         = "abatugo_autoscribe_container"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::061051226319:role/abatugo_autoscribe_execution_role"
      + family                   = "abatugo_autoscribe_task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::061051226319:role/abatugo_autoscribe_task_role"
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 50
        }
    }

  # aws_iam_role_policy_attachment.abatugo_autoscribe_ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "abatugo_autoscribe_ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "abatugo_autoscribe_execution_role"
    }

  # aws_iam_role_policy_attachment.abatugo_autoscribe_ecs_task_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "abatugo_autoscribe_ecs_task_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "abatugo_autoscribe_task_role"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_role_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      - id         = "abatugo_autoscribe_execution_role-20250320180548145600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "abatugo_autoscribe_execution_role" -> null
    }

  # aws_iam_role_policy_attachment.ecs_task_role_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_role_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_role_policy_attachment" {
      - id         = "abatugo_autoscribe_task_role-20250320180548388300000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess" -> null
      - role       = "abatugo_autoscribe_task_role" -> null
    }
```
second update: 
```
Terraform will perform the following actions:

  # aws_ecs_task_definition.abatugo_autoscribe_task must be replaced
-/+ resource "aws_ecs_task_definition" "abatugo_autoscribe_task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:061051226319:task-definition/abatugo_autoscribe_task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:061051226319:task-definition/abatugo_autoscribe_task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ cpu            = 10 -> 256
                  - mountPoints    = []
                    name           = "abatugo_autoscribe_container"
                  ~ portMappings   = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "abatugo_autoscribe_task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.abatugo_autoscribe_ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "abatugo_autoscribe_ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "abatugo_autoscribe_execution_role"
    }

```
removing default code about ports: 

```
Terraform will perform the following actions:

  # aws_ecs_task_definition.abatugo_autoscribe_task must be replaced
-/+ resource "aws_ecs_task_definition" "abatugo_autoscribe_task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:061051226319:task-definition/abatugo_autoscribe_task:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:061051226319:task-definition/abatugo_autoscribe_task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints    = []
                    name           = "abatugo_autoscribe_container"
                  - portMappings   = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "abatugo_autoscribe_task" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```